CSI API ETABS v1
cCaseModalEigen.SetCase Method
 This function initializes a modal Eigen load case. If this function is called for an existing load case, all items for the case are reset to their default value.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetCase(
	string Name
)
Function SetCase (
	Name As String
) As Integer
Dim instance As cCaseModalEigen
Dim Name As String
Dim returnValue As Integer
returnValue = instance.SetCase(Name)
int SetCase(
	String^ Name
)
abstract SetCase :
        Name : string -> int
Parameters
Name
Type: System.String
 The name of an existing or new load case. If this is an existing case, that case is modified; otherwise, a new case is added.
Return Value
Type: Int32
 The function returns zero if the load case is successfully initialized; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
    ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'add modal Eigen load case
    ret = SapModel.LoadCases.ModalEigen.SetCase("LCASE1")
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cCaseModalEigen Interface
ETABSv1 Namespace